package com.example.asynclearning

import kotlinx.coroutines.delay
import kotlinx.coroutines.launch
import kotlinx.coroutines.runBlocking

// асинхронність - це виконання операцій,
// які займають певний час,
// без блокування головного потоку


// корутина не блокує основний потік (main thread), поки очікує на закінчення асинхронної операції

// при очікуванні завершення асинхронної операції (ця операція може знаходитися всередині suspend fun)
// корутина призупиняється,
// надаючи можливість виконувати основний потік далі,
// а при завершенні - відновлюється

// основні елементи корутин:
// 1. suspend fun - функція, що призупиняється, коли дійде до очікування виконання асинхронної операції,
// щоб корутина звільнила потік для інших задач.
// коли асинхронна операція закінчиться, функція відновить своє виконання
// 2. launch - корутина, яка нічого неповертає
// 3. async - корутина, яка повертає якесь значення



fun main() = runBlocking { // запуск головної корутини

    println("start")
    val job = launch { // повертає Job - контроллер життєвого циклу
//        delay(5000)
//        println("coroutine is done")
        func()
    }
    println("waiting")
    job.join() // вказуємо чекти завершення корутини
    println("end")
}

suspend fun func() {
    delay(5000)
    println("coroutine is done")
}